<?php
// app/helpers/ProvinceHelper.php

class ProvinceHelper {
    public static function getProvinces() {
        return [
            "آذربایجان شرقی",
            "آذربایجان غربی",
            "اردبیل",
            "اصفهان",
            "البرز",
            "ایلام",
            "بوشهر",
            "تهران",
            "چهارمحال و بختیاری",
            "خراسان جنوبی",
            "خراسان رضوی",
            "خراسان شمالی",
            "خوزستان",
            "زنجان",
            "سمنان",
            "سیستان و بلوچستان",
            "فارس",
            "قزوین",
            "قم",
            "کردستان",
            "کرمان",
            "کرمانشاه",
            "کهگیلویه و بویراحمد",
            "گلستان",
            "گیلان",
            "لرستان",
            "مازندران",
            "مرکزی",
            "هرمزگان",
            "همدان",
            "یزد"
        ];
    }

    public static function getCities() {
        return [
            "تهران" => ["تهران", "شهریار", "اسلامشهر", "ری", "پردیس", "ورامین", "پاکدشت", "رباط کریم", "پیشوا", "دماوند", "فیروزکوه"],
            "اصفهان" => ["اصفهان", "کاشان", "نجف آباد", "خمینی شهر", "شاهین شهر", "شهرضا", "مبارکه", "فولادشهر", "گلپایگان", "نطنز"],
            "مشهد" => ["مشهد", "نیشابور", "سبزوار", "تربت حیدریه", "کاشمر", "قوچان", "تربت جام", "چناران", "سرخس", "گناباد"],
            "شیراز" => ["شیراز", "مرودشت", "جهرم", "فسا", "کازرون", "لار", "داراب", "فیروزآباد", "نی ریز", "آباده"],
            "تبریز" => ["تبریز", "مراغه", "مرند", "میانه", "اهر", "بناب", "سراب", "شبستر", "هشترود", "جلفا"],
            "کرج" => ["کرج", "فردیس", "هشتگرد", "محمدشهر", "ماهدشت", "مشکین دشت", "اشتهارد", "کمال شهر", "نظرآباد", "چهارباغ"],
            "قم" => ["قم", "پردیسان", "قنوات", "جعفریه", "دستجرد", "سلفچگان", "کهک"],
            "اهواز" => ["اهواز", "دزفول", "آبادان", "خرمشهر", "ماهشهر", "بهبهان", "ایذه", "شوشتر", "اندیمشک", "شوش"],
            "کرمانشاه" => ["کرمانشاه", "اسلام آباد غرب", "کنگاور", "سنقر", "پاوه", "جوانرود", "هرسین", "صحنه", "گیلانغرب", "روانسر"],
            "ارومیه" => ["ارومیه", "خوی", "میاندوآب", "بوکان", "مهاباد", "سلماس", "نقده", "پیرانشهر", "سردشت", "اشنویه"]
        ];
    }
}
